ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
<module id="XBAR_REGS" HW_revision="" description="XBAR Registers">
	<register id="XBARFLG1" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 1">
		<bitfield id="CMPSS1_CTRIPL" description="Input Flag for CMPSS1_CTRIPL Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMPSS1_CTRIPH" description="Input Flag for CMPSS1_CTRIPH Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPL" description="Input Flag for CMPSS2_CTRIPL Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPH" description="Input Flag for CMPSS2_CTRIPH Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPL" description="Input Flag for CMPSS3_CTRIPL Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPH" description="Input Flag for CMPSS3_CTRIPH Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPL" description="Input Flag for CMPSS4_CTRIPL Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPH" description="Input Flag for CMPSS4_CTRIPH Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CMPSS5_CTRIPL" description="Input Flag for CMPSS5_CTRIPL Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPSS5_CTRIPH" description="Input Flag for CMPSS5_CTRIPH Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPSS6_CTRIPL" description="Input Flag for CMPSS6_CTRIPL Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CMPSS6_CTRIPH" description="Input Flag for CMPSS6_CTRIPH Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CMPSS7_CTRIPL" description="Input Flag for CMPSS7_CTRIPL Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CMPSS7_CTRIPH" description="Input Flag for CMPSS7_CTRIPH Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CMPSS8_CTRIPL" description="Input Flag for CMPSS8_CTRIPL Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CMPSS8_CTRIPH" description="Input Flag for CMPSS8_CTRIPH Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPH" description="Input Flag for CMPSS9_CTRIPH Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPL" description="Input Flag for CMPSS9_CTRIPL Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPH" description="Input Flag for CMPSS10_CTRIPH Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPL" description="Input Flag for CMPSS10_CTRIPL Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPH" description="Input Flag for CMPSS11_CTRIPH Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPL" description="Input Flag for CMPSS11_CTRIPL Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPH" description="Input Flag for CMPSS12_CTRIPH Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPL" description="Input Flag for CMPSS12_CTRIPL Signal" begin="23" end="23" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG2" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 2">
		<bitfield id="CMPSS1_CTRIPOUTL" description="Input Flag for CMPSS1_CTRIPOUTL Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMPSS1_CTRIPOUTH" description="Input Flag for CMPSS1_CTRIPOUTH Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPOUTL" description="Input Flag for CMPSS2_CTRIPOUTL Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPOUTH" description="Input Flag for CMPSS2_CTRIPOUTH Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPOUTL" description="Input Flag for CMPSS3_CTRIPOUTL Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPOUTH" description="Input Flag for CMPSS3_CTRIPOUTH Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPOUTL" description="Input Flag for CMPSS4_CTRIPOUTL Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPOUTH" description="Input Flag for CMPSS4_CTRIPOUTH Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CMPSS5_CTRIPOUTL" description="Input Flag for CMPSS5_CTRIPOUTL Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPSS5_CTRIPOUTH" description="Input Flag for CMPSS5_CTRIPOUTH Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPSS6_CTRIPOUTL" description="Input Flag for CMPSS6_CTRIPOUTL Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CMPSS6_CTRIPOUTH" description="Input Flag for CMPSS6_CTRIPOUTH Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CMPSS7_CTRIPOUTL" description="Input Flag for CMPSS7_CTRIPOUTL Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CMPSS7_CTRIPOUTH" description="Input Flag for CMPSS7_CTRIPOUTH Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CMPSS8_CTRIPOUTL" description="Input Flag for CMPSS8_CTRIPOUTL Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CMPSS8_CTRIPOUTH" description="Input Flag for CMPSS8_CTRIPOUTH Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPOUTH" description="Input Flag for CMPSS9_CTRIPOUTH Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPOUTL" description="Input Flag for CMPSS9_CTRIPOUTL Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPOUTH" description="Input Flag for CMPSS10_CTRIPOUTH Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPOUTL" description="Input Flag for CMPSS10_CTRIPOUTL Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPOUTH" description="Input Flag for CMPSS11_CTRIPOUTH Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPOUTL" description="Input Flag for CMPSS11_CTRIPOUTL Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPOUTH" description="Input Flag for CMPSS12_CTRIPOUTH Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPOUTL" description="Input Flag for CMPSS12_CTRIPOUTL Signal" begin="23" end="23" width="1" rwaccess="R"/>
	</register>
