ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARFLG3" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 3">
		<bitfield id="SD1FLT1_COMPL" description="Input Flag for SD1FLT1_COMPL Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag for SD1FLT1_COMPH Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag for SD1FLT2_COMPL Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag for SD1FLT2_COMPH Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag for SD1FLT3_COMPL Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag for SD1FLT3_COMPH Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag for SD1FLT4_COMPL Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag for SD1FLT4_COMPH Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag for SD2FLT1_COMPL Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag for SD2FLT1_COMPH Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag for SD2FLT2_COMPL Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag for SD2FLT2_COMPH Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag for SD2FLT3_COMPL Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag for SD2FLT3_COMPH Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag for SD2FLT4_COMPL Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag for SD2FLT4_COMPH Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT1_COMPH" description="Input Flag for SD3FLT1_COMPH Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT1_COMPL" description="Input Flag for SD3FLT1_COMPL Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT2_COMPH" description="Input Flag for SD3FLT2_COMPH Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT2_COMPL" description="Input Flag for SD3FLT2_COMPL Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT3_COMPH" description="Input Flag for SD3FLT3_COMPH Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT3_COMPL" description="Input Flag for SD3FLT3_COMPL Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT4_COMPH" description="Input Flag for SD3FLT4_COMPH Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT4_COMPL" description="Input Flag for SD3FLT4_COMPL Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT1_COMPH" description="Input Flag for SD4FLT1_COMPH Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT1_COMPL" description="Input Flag for SD4FLT1_COMPL Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT2_COMPH" description="Input Flag for SD4FLT2_COMPH Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT2_COMPL" description="Input Flag for SD4FLT2_COMPL Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT3_COMPH" description="Input Flag for SD4FLT3_COMPH Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT3_COMPL" description="Input Flag for SD4FLT3_COMPL Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT4_COMPH" description="Input Flag for SD4FLT4_COMPH Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT4_COMPL" description="Input Flag for SD4FLT4_COMPL Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG4" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 4">
		<bitfield id="INPUT1" description="Input Flag for INPUT1 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INPUT2" description="Input Flag for INPUT2 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INPUT3" description="Input Flag for INPUT3 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INPUT4" description="Input Flag for INPUT4 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INPUT5" description="Input Flag for INPUT5 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INPUT6" description="Input Flag for INPUT6 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INPUT7" description="Input Flag for INPUT7 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INPUT8" description="Input Flag for INPUT8 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="INPUT9" description="Input Flag for INPUT9 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="INPUT10" description="Input Flag for INPUT10 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="INPUT11" description="Input Flag for INPUT11 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="INPUT12" description="Input Flag for INPUT12 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="INPUT13" description="Input Flag for INPUT13 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="INPUT14" description="Input Flag for INPUT14 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="INPUT15" description="Input Flag for INPUT15 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="INPUT16" description="Input Flag for INPUT16 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="INPUT17" description="Input Flag for INPUT17 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="INPUT18" description="Input Flag for INPUT18 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="INPUT19" description="Input Flag for INPUT19 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="INPUT20" description="Input Flag for INPUT20 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="INPUT21" description="Input Flag for INPUT21 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="INPUT22" description="Input Flag for INPUT22 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="INPUT23" description="Input Flag for INPUT23 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="INPUT24" description="Input Flag for INPUT24 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="INPUT25" description="Input Flag for INPUT25 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="INPUT26" description="Input Flag for INPUT26 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="INPUT27" description="Input Flag for INPUT27 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="INPUT28" description="Input Flag for INPUT28 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="INPUT29" description="Input Flag for INPUT29 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="INPUT30" description="Input Flag for INPUT30 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="INPUT31" description="Input Flag for INPUT31 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="INPUT32" description="Input Flag for INPUT32 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
