ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARFLG5" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 5">
		<bitfield id="ADCAEVT1" description="Input Flag for ADCAEVT1  Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT2" description="Input Flag for ADCAEVT2  Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT3" description="Input Flag for ADCAEVT3  Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT4" description="Input Flag for ADCAEVT4  Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT1" description="Input Flag for ADCBEVT1  Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT2" description="Input Flag for ADCBEVT2  Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT3" description="Input Flag for ADCBEVT3  Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT4" description="Input Flag for ADCBEVT4  Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT1" description="Input Flag for ADCCEVT1  Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT2" description="Input Flag for ADCCEVT2  Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT3" description="Input Flag for ADCCEVT3  Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT4" description="Input Flag for ADCCEVT4  Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ADCDEVT1" description="Input Flag for ADCDEVT1  Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ADCDEVT2" description="Input Flag for ADCDEVT2  Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ADCDEVT3" description="Input Flag for ADCDEVT3  Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ADCDEVT4" description="Input Flag for ADCDEVT4  Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ADCEEVT1" description="Input Flag for ADCEEVT1  Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ADCEEVT2" description="Input Flag for ADCEEVT2  Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ADCEEVT3" description="Input Flag for ADCEEVT3  Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ADCEEVT4" description="Input Flag for ADCEEVT4  Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT1" description="Input Flag for CPU1_ADCCHECKEVT1  Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT2" description="Input Flag for CPU1_ADCCHECKEVT2  Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT3" description="Input Flag for CPU1_ADCCHECKEVT3  Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT4" description="Input Flag for CPU1_ADCCHECKEVT4  Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT1" description="Input Flag for CPU2_ADCCHECKEVT1  Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT2" description="Input Flag for CPU2_ADCCHECKEVT2  Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT3" description="Input Flag for CPU2_ADCCHECKEVT3  Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT4" description="Input Flag for CPU2_ADCCHECKEVT4  Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CPU3_ADCCHECKEVT1" description="Input Flag for CPU3_ADCCHECKEVT1  Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CPU3_ADCCHECKEVT2" description="Input Flag for CPU3_ADCCHECKEVT2  Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="CPU3_ADCCHECKEVT3" description="Input Flag for CPU3_ADCCHECKEVT3  Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CPU3_ADCCHECKEVT4" description="Input Flag for CPU3_ADCCHECKEVT4  Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG6" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 6">
		<bitfield id="CLB1_OUT4" description="Input Latch for CLB1_OUT4 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT5" description="Input Latch for CLB1_OUT5 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT4" description="Input Latch for CLB2_OUT4 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT5" description="Input Latch for CLB2_OUT5 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT4" description="Input Latch for CLB3_OUT4 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT5" description="Input Latch for CLB3_OUT5 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT4" description="Input Latch for CLB4_OUT4 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT5" description="Input Latch for CLB4_OUT5 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT4" description="Input Latch for CLB5_OUT4 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT5" description="Input Latch for CLB5_OUT5 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT4" description="Input Latch for CLB6_OUT4 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT5" description="Input Latch for CLB6_OUT5 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="FSIA_RX_TRIG1" description="Input Flag for FSIA_RX_TRIG1 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="FSIB_RX_TRIG1" description="Input Flag for FSIB_RX_TRIG1 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="FSIC_RX_TRIG1" description="Input Flag for FSIC_RX_TRIG1 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="FSID_RX_TRIG1" description="Input Flag for FSID_RX_TRIG1 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT0" description="Input Flag for WADI1OUT0 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT1" description="Input Flag for WADI1OUT1 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT2" description="Input Flag for WADI1OUT2 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT3" description="Input Flag for WADI1OUT3 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT4" description="Input Flag for WADI1OUT4 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT5" description="Input Flag for WADI1OUT5 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT6" description="Input Flag for WADI1OUT6 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="WADI1OUT7" description="Input Flag for WADI1OUT7 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ECATSYNC0" description="Input Latch for ECATSYNC0 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ECATSYNC1" description="Input Latch for ECATSYNC1 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG7" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 7">
		<bitfield id="ECAP1_OUT" description="Input Flag for ECAP1_OUT Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ECAP2_OUT" description="Input Flag for ECAP2_OUT Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ECAP3_OUT" description="Input Flag for ECAP3_OUT Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ECAP4_OUT" description="Input Flag for ECAP4_OUT Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ECAP5_OUT" description="Input Flag for ECAP5_OUT Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ECAP6_OUT" description="Input Flag for ECAP6_OUT Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ECAP1_TRIPOUT" description="Input Flag for ECAP1_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ECAP2_TRIPOUT" description="Input Flag for ECAP2_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ECAP3_TRIPOUT" description="Input Flag for ECAP3_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ECAP4_TRIPOUT" description="Input Flag for ECAP4_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ECAP5_TRIPOUT" description="Input Flag for ECAP5_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ECAP6_TRIPOUT" description="Input Flag for ECAP6_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ADCSOCA" description="Input Flag for ADCSOCA Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ADCSOCB" description="Input Flag for ADCSOCB Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ESMGENEVT" description="Input Flag for ESMGENEVT Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXTSYNCOUT" description="Input Flag for EXTSYNCOUT Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT0" description="Input Flag for WADI2OUT0 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT1" description="Input Flag for WADI2OUT1 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT2" description="Input Flag for WADI2OUT2 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT3" description="Input Flag for WADI2OUT3 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT4" description="Input Flag for WADI2OUT4 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT5" description="Input Flag for WADI2OUT5 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT6" description="Input Flag for WADI2OUT6 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="WADI2OUT7" description="Input Flag for WADI2OUT7 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG8" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 8">
		<bitfield id="EPWM1_TRIPOUT" description="Input Flag for EPWM1_TRIPOUT Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_TRIPOUT" description="Input Flag for EPWM2_TRIPOUT Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_TRIPOUT" description="Input Flag for EPWM3_TRIPOUT Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_TRIPOUT" description="Input Flag for EPWM4_TRIPOUT Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_TRIPOUT" description="Input Flag for EPWM5_TRIPOUT Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_TRIPOUT" description="Input Flag for EPWM6_TRIPOUT Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_TRIPOUT" description="Input Flag for EPWM7_TRIPOUT Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_TRIPOUT" description="Input Flag for EPWM8_TRIPOUT Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_TRIPOUT" description="Input Flag for EPWM9_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_TRIPOUT" description="Input Flag for EPWM10_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_TRIPOUT" description="Input Flag for EPWM11_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_TRIPOUT" description="Input Flag for EPWM12_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_TRIPOUT" description="Input Flag for EPWM13_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_TRIPOUT" description="Input Flag for EPWM14_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_TRIPOUT" description="Input Flag for EPWM15_TRIPOUT Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_TRIPOUT" description="Input Flag for EPWM16_TRIPOUT Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_TRIPOUT" description="Input Flag for EPWM17_TRIPOUT Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_TRIPOUT" description="Input Flag for EPWM18_TRIPOUT Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
