ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARFLG9" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 9">
		<bitfield id="EPWM1_DEL_TRIP" description="Input Flag for EPWM1_DEL_TRIP Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_DEL_TRIP" description="Input Flag for EPWM2_DEL_TRIP Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_DEL_TRIP" description="Input Flag for EPWM3_DEL_TRIP Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_DEL_TRIP" description="Input Flag for EPWM4_DEL_TRIP Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_DEL_TRIP" description="Input Flag for EPWM5_DEL_TRIP Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_DEL_TRIP" description="Input Flag for EPWM6_DEL_TRIP Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_DEL_TRIP" description="Input Flag for EPWM7_DEL_TRIP Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_DEL_TRIP" description="Input Flag for EPWM8_DEL_TRIP Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_DEL_TRIP" description="Input Flag for EPWM9_DEL_TRIP Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_DEL_TRIP" description="Input Flag for EPWM10_DEL_TRIP Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_DEL_TRIP" description="Input Flag for EPWM11_DEL_TRIP Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_DEL_TRIP" description="Input Flag for EPWM12_DEL_TRIP Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_DEL_TRIP" description="Input Flag for EPWM13_DEL_TRIP Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_DEL_TRIP" description="Input Flag for EPWM14_DEL_TRIP Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_DEL_TRIP" description="Input Flag for EPWM15_DEL_TRIP Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_DEL_TRIP" description="Input Flag for EPWM16_DEL_TRIP Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_DEL_TRIP" description="Input Flag for EPWM17_DEL_TRIP Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_DEL_TRIP" description="Input Flag for EPWM18_DEL_TRIP Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG10" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 10">
		<bitfield id="EPWM1_DEL_ACTIVE" description="Input Flag for EPWM1_DEL_ACTIVE Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_DEL_ACTIVE" description="Input Flag for EPWM2_DEL_ACTIVE Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_DEL_ACTIVE" description="Input Flag for EPWM3_DEL_ACTIVE Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_DEL_ACTIVE" description="Input Flag for EPWM4_DEL_ACTIVE Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_DEL_ACTIVE" description="Input Flag for EPWM5_DEL_ACTIVE Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_DEL_ACTIVE" description="Input Flag for EPWM6_DEL_ACTIVE Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_DEL_ACTIVE" description="Input Flag for EPWM7_DEL_ACTIVE Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_DEL_ACTIVE" description="Input Flag for EPWM8_DEL_ACTIVE Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_DEL_ACTIVE" description="Input Flag for EPWM9_DEL_ACTIVE Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_DEL_ACTIVE" description="Input Flag for EPWM10_DEL_ACTIVE Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_DEL_ACTIVE" description="Input Flag for EPWM11_DEL_ACTIVE Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_DEL_ACTIVE" description="Input Flag for EPWM12_DEL_ACTIVE Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_DEL_ACTIVE" description="Input Flag for EPWM13_DEL_ACTIVE Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_DEL_ACTIVE" description="Input Flag for EPWM14_DEL_ACTIVE Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_DEL_ACTIVE" description="Input Flag for EPWM15_DEL_ACTIVE Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_DEL_ACTIVE" description="Input Flag for EPWM16_DEL_ACTIVE Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_DEL_ACTIVE" description="Input Flag for EPWM17_DEL_ACTIVE Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_DEL_ACTIVE" description="Input Flag for EPWM18_DEL_ACTIVE Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG11" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 11">
		<bitfield id="EPWM1_A0_sclk" description="Input Flag for EPWM1_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM1_B0_sclk" description="Input Flag for EPWM1_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_A0_sclk" description="Input Flag for EPWM2_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_B0_sclk" description="Input Flag for EPWM2_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_A0_sclk" description="Input Flag for EPWM3_A0_sclk Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_B0_sclk" description="Input Flag for EPWM3_B0_sclk Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_A0_sclk" description="Input Flag for EPWM4_A0_sclk Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_B0_sclk" description="Input Flag for EPWM4_B0_sclk Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_A0_sclk" description="Input Flag for EPWM5_A0_sclk Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_B0_sclk" description="Input Flag for EPWM5_B0_sclk Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_A0_sclk" description="Input Flag for EPWM6_A0_sclk Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_B0_sclk" description="Input Flag for EPWM6_B0_sclk Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_A0_sclk" description="Input Flag for EPWM7_A0_sclk Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_B0_sclk" description="Input Flag for EPWM7_B0_sclk Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_A0_sclk" description="Input Flag for EPWM8_A0_sclk Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_B0_sclk" description="Input Flag for EPWM8_B0_sclk Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_A0_sclk" description="Input Flag for EPWM9_A0_sclk Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_B0_sclk" description="Input Flag for EPWM9_B0_sclk Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_A0_sclk" description="Input Flag for EPWM10_A0_sclk Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_B0_sclk" description="Input Flag for EPWM10_B0_sclk Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_A0_sclk" description="Input Flag for EPWM11_A0_sclk Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_B0_sclk" description="Input Flag for EPWM11_B0_sclk Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_A0_sclk" description="Input Flag for EPWM12_A0_sclk Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_B0_sclk" description="Input Flag for EPWM12_B0_sclk Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_A0_sclk" description="Input Flag for EPWM13_A0_sclk Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_B0_sclk" description="Input Flag for EPWM13_B0_sclk Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_A0_sclk" description="Input Flag for EPWM14_A0_sclk Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_B0_sclk" description="Input Flag for EPWM14_B0_sclk Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_A0_sclk" description="Input Flag for EPWM15_A0_sclk Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_B0_sclk" description="Input Flag for EPWM15_B0_sclk Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_A0_sclk" description="Input Flag for EPWM16_A0_sclk Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_B0_sclk" description="Input Flag for EPWM16_B0_sclk Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG12" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 12">
		<bitfield id="EPWM17_A0_sclk" description="Input Flag for EPWM17_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_B0_sclk" description="Input Flag for EPWM17_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_A0_sclk" description="Input Flag for EPWM18_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_B0_sclk" description="Input Flag for EPWM18_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG13" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 13">
		<bitfield id="MDL1_OUTA" description="Input Flag for MDL1_OUTA Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MDL1_OUTB" description="Input Flag for MDL1_OUTB Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MDL2_OUTA" description="Input Flag for MDL2_OUTA Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MDL2_OUTB" description="Input Flag for MDL2_OUTB Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MDL3_OUTA" description="Input Flag for MDL3_OUTA Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MDL3_OUTB" description="Input Flag for MDL3_OUTB Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="MDL4_OUTA" description="Input Flag for MDL4_OUTA Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="MDL4_OUTB" description="Input Flag for MDL4_OUTB Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MDL5_OUTA" description="Input Flag for MDL5_OUTA Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MDL5_OUTB" description="Input Flag for MDL5_OUTB Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MDL6_OUTA" description="Input Flag for MDL6_OUTA Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MDL6_OUTB" description="Input Flag for MDL6_OUTB Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="MDL7_OUTA" description="Input Flag for MDL7_OUTA Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="MDL7_OUTB" description="Input Flag for MDL7_OUTB Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="MDL8_OUTA" description="Input Flag for MDL8_OUTA Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="MDL8_OUTB" description="Input Flag for MDL8_OUTB Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="MDL9_OUTA" description="Input Flag for MDL9_OUTA Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="MDL9_OUTB" description="Input Flag for MDL9_OUTB Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="MDL10_OUTA" description="Input Flag for MDL10_OUTA Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="MDL10_OUTB" description="Input Flag for MDL10_OUTB Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="MDL11_OUTA" description="Input Flag for MDL11_OUTA Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="MDL11_OUTB" description="Input Flag for MDL11_OUTB Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="MDL12_OUTA" description="Input Flag for MDL12_OUTA Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="MDL12_OUTB" description="Input Flag for MDL12_OUTB Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="MDL13_OUTA" description="Input Flag for MDL13_OUTA Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="MDL13_OUTB" description="Input Flag for MDL13_OUTB Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="MDL14_OUTA" description="Input Flag for MDL14_OUTA Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="MDL14_OUTB" description="Input Flag for MDL14_OUTB Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="MDL15_OUTA" description="Input Flag for MDL15_OUTA Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="MDL15_OUTB" description="Input Flag for MDL15_OUTB Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="MDL16_OUTA" description="Input Flag for MDL16_OUTA Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="MDL16_OUTB" description="Input Flag for MDL16_OUTB Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
