ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARFLG14" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 14">
		<bitfield id="MDL17_OUTA" description="Input Flag for MDL17_OUTA Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MDL17_OUTB" description="Input Flag for MDL17_OUTB Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MDL18_OUTA" description="Input Flag for MDL18_OUTA Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MDL18_OUTB" description="Input Flag for MDL18_OUTB Signal" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG15" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 15">
		<bitfield id="CLB1_OUT0" description="Input Flag for CLB1_OUT0 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT1" description="Input Flag for CLB1_OUT1 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT2" description="Input Flag for CLB1_OUT2 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT3" description="Input Flag for CLB1_OUT3 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT6" description="Input Flag for CLB1_OUT6 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT7" description="Input Flag for CLB1_OUT7 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT0" description="Input Flag for CLB2_OUT0 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT1" description="Input Flag for CLB2_OUT1 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT2" description="Input Flag for CLB2_OUT2 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT3" description="Input Flag for CLB2_OUT3 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT6" description="Input Flag for CLB2_OUT6 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT7" description="Input Flag for CLB2_OUT7 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT0" description="Input Flag for CLB3_OUT0 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT1" description="Input Flag for CLB3_OUT1 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT2" description="Input Flag for CLB3_OUT2 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT3" description="Input Flag for CLB3_OUT3 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT6" description="Input Flag for CLB3_OUT6 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT7" description="Input Flag for CLB3_OUT7 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT0" description="Input Flag for CLB4_OUT0 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT1" description="Input Flag for CLB4_OUT1 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT2" description="Input Flag for CLB4_OUT2 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT3" description="Input Flag for CLB4_OUT3 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT6" description="Input Flag for CLB4_OUT6 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT7" description="Input Flag for CLB4_OUT7 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT0" description="Input Flag for CLB5_OUT0 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT1" description="Input Flag for CLB5_OUT1 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT2" description="Input Flag for CLB5_OUT2 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT3" description="Input Flag for CLB5_OUT3 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT6" description="Input Flag for CLB5_OUT6 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT7" description="Input Flag for CLB5_OUT7 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT0" description="Input Flag for CLB6_OUT0 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT1" description="Input Flag for CLB6_OUT1 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG16" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 16">
		<bitfield id="CLB6_OUT2" description="Input Flag for CLB6_OUT2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT3" description="Input Flag for CLB6_OUT3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT6" description="Input Flag for CLB6_OUT6 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT7" description="Input Flag for CLB6_OUT7 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL0" description="Input Flag for ADCA_EXTMUXSEL0 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL1" description="Input Flag for ADCA_EXTMUXSEL1 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL2" description="Input Flag for ADCA_EXTMUXSEL2 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL3" description="Input Flag for ADCA_EXTMUXSEL3 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL0" description="Input Flag for ADCB_EXTMUXSEL0 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL1" description="Input Flag for ADCB_EXTMUXSEL1 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL2" description="Input Flag for ADCB_EXTMUXSEL2 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL3" description="Input Flag for ADCB_EXTMUXSEL3 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL0" description="Input Flag for ADCC_EXTMUXSEL0 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL1" description="Input Flag for ADCC_EXTMUXSEL1 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL2" description="Input Flag for ADCC_EXTMUXSEL2 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL3" description="Input Flag for ADCC_EXTMUXSEL3 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ADCD_EXTMUXSEL0" description="Input Flag for ADCD_EXTMUXSEL0 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ADCD_EXTMUXSEL1" description="Input Flag for ADCD_EXTMUXSEL1 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ADCD_EXTMUXSEL2" description="Input Flag for ADCD_EXTMUXSEL2 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ADCD_EXTMUXSEL3" description="Input Flag for ADCD_EXTMUXSEL3 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ADCE_EXTMUXSEL0" description="Input Flag for ADCE_EXTMUXSEL0 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="ADCE_EXTMUXSEL1" description="Input Flag for ADCE_EXTMUXSEL1 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ADCE_EXTMUXSEL2" description="Input Flag for ADCE_EXTMUXSEL2 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ADCE_EXTMUXSEL3" description="Input Flag for ADCE_EXTMUXSEL3 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT0" description="Input Flag for EPG1_EPGOUT0 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT1" description="Input Flag for EPG1_EPGOUT1 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT2" description="Input Flag for EPG1_EPGOUT2 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT3" description="Input Flag for EPG1_EPGOUT3 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG17" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 16">
		<bitfield id="MCANA_FEVT0" description="Input Flag for MCANA_FEVT0 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT1" description="Input Flag for MCANA_FEVT1 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT2" description="Input Flag for MCANA_FEVT2 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT0" description="Input Flag for MCANB_FEVT0 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT1" description="Input Flag for MCANB_FEVT1 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT2" description="Input Flag for MCANB_FEVT2 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="MCANC_FEVT0" description="Input Flag for MCANC_FEVT0 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="MCANC_FEVT1" description="Input Flag for MCANC_FEVT1 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MCANC_FEVT2" description="Input Flag for MCANC_FEVT2 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MCAND_FEVT0" description="Input Flag for MCAND_FEVT0 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MCAND_FEVT1" description="Input Flag for MCAND_FEVT1 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MCAND_FEVT2" description="Input Flag for MCAND_FEVT2 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="MCANE_FEVT0" description="Input Flag for MCANE_FEVT0 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="MCANE_FEVT1" description="Input Flag for MCANE_FEVT1 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="MCANE_FEVT2" description="Input Flag for MCANE_FEVT2 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="MCANF_FEVT0" description="Input Flag for MCANF_FEVT0 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="MCANF_FEVT1" description="Input Flag for MCANF_FEVT1 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="MCANF_FEVT2" description="Input Flag for MCANF_FEVT2 Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG18" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Register 16">
		<bitfield id="FSIRXA_TRIG_2" description="Input Flag for FSIRXA_TRIG_2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FSIRXA_TRIG_3" description="Input Flag for FSIRXA_TRIG_3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="FSIRXB_TRIG_2" description="Input Flag for FSIRXB_TRIG_2 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FSIRXB_TRIG_3" description="Input Flag for FSIRXB_TRIG_3 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="FSIRXC_TRIG_2" description="Input Flag for FSIRXC_TRIG_2 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FSIRXC_TRIG_3" description="Input Flag for FSIRXC_TRIG_3 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FSIRXD_TRIG_2" description="Input Flag for FSIRXD_TRIG_2 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="FSIRXD_TRIG_3" description="Input Flag for FSIRXD_TRIG_3 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT8" description="Input Flag for CPU1ERADEVT8 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT9" description="Input Flag for CPU1ERADEVT9 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT10" description="Input Flag for CPU1ERADEVT10 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT11" description="Input Flag for CPU1ERADEVT11 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT8" description="Input Flag for CPU2ERADEVT8 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT9" description="Input Flag for CPU2ERADEVT9 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT10" description="Input Flag for CPU2ERADEVT10 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT11" description="Input Flag for CPU2ERADEVT11 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CPU3ERADEVT8" description="Input Flag for CPU3ERADEVT8 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CPU3ERADEVT9" description="Input Flag for CPU3ERADEVT9 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CPU3ERADEVT10" description="Input Flag for CPU3ERADEVT10 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CPU3ERADEVT11" description="Input Flag for CPU3ERADEVT11 Signal" begin="19" end="19" width="1" rwaccess="R"/>
	</register>
	<register id="XBARCLR1" width="32" page="0" offset="0x100" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 1">
		<bitfield id="CMPSS1_CTRIPL" description="Input Flag Clear for CMPSS1_CTRIPL Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPH" description="Input Flag Clear for CMPSS1_CTRIPH Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPL" description="Input Flag Clear for CMPSS2_CTRIPL Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPH" description="Input Flag Clear for CMPSS2_CTRIPH Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPL" description="Input Flag Clear for CMPSS3_CTRIPL Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPH" description="Input Flag Clear for CMPSS3_CTRIPH Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPL" description="Input Flag Clear for CMPSS4_CTRIPL Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPH" description="Input Flag Clear for CMPSS4_CTRIPH Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPL" description="Input Flag Clear for CMPSS5_CTRIPL Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPH" description="Input Flag Clear for CMPSS5_CTRIPH Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPL" description="Input Flag Clear for CMPSS6_CTRIPL Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPH" description="Input Flag Clear for CMPSS6_CTRIPH Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPL" description="Input Flag Clear for CMPSS7_CTRIPL Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPH" description="Input Flag Clear for CMPSS7_CTRIPH Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPL" description="Input Flag Clear for CMPSS8_CTRIPL Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPH" description="Input Flag Clear for CMPSS8_CTRIPH Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPH" description="Input Flag Clear for CMPSS9_CTRIPH Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPL" description="Input Flag Clear for CMPSS9_CTRIPL Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPH" description="Input Flag Clear for CMPSS10_CTRIPH Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPL" description="Input Flag Clear for CMPSS10_CTRIPL Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPH" description="Input Flag Clear for CMPSS11_CTRIPH Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPL" description="Input Flag Clear for CMPSS11_CTRIPL Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPH" description="Input Flag Clear for CMPSS12_CTRIPH Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPL" description="Input Flag Clear for CMPSS12_CTRIPL Signal" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR2" width="32" page="0" offset="0x104" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 2">
		<bitfield id="CMPSS1_CTRIPOUTL" description="Input Flag clear for CMPSS1_CTRIPOUTL Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPOUTH" description="Input Flag clear for CMPSS1_CTRIPOUTH Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTL" description="Input Flag clear for CMPSS2_CTRIPOUTL Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTH" description="Input Flag clear for CMPSS2_CTRIPOUTH Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTL" description="Input Flag clear for CMPSS3_CTRIPOUTL Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTH" description="Input Flag clear for CMPSS3_CTRIPOUTH Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTL" description="Input Flag clear for CMPSS4_CTRIPOUTL Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTH" description="Input Flag clear for CMPSS4_CTRIPOUTH Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPOUTL" description="Input Flag clear for CMPSS5_CTRIPOUTL Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPOUTH" description="Input Flag clear for CMPSS5_CTRIPOUTH Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPOUTL" description="Input Flag clear for CMPSS6_CTRIPOUTL Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPOUTH" description="Input Flag clear for CMPSS6_CTRIPOUTH Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPOUTL" description="Input Flag clear for CMPSS7_CTRIPOUTL Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPOUTH" description="Input Flag clear for CMPSS7_CTRIPOUTH Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPOUTL" description="Input Flag clear for CMPSS8_CTRIPOUTL Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPOUTH" description="Input Flag clear for CMPSS8_CTRIPOUTH Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPOUTH" description="Input Flag clear for CMPSS9_CTRIPOUTH Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPOUTL" description="Input Flag clear for CMPSS9_CTRIPOUTL Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPOUTH" description="Input Flag clear for CMPSS10_CTRIPOUTH Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPOUTL" description="Input Flag clear for CMPSS10_CTRIPOUTL Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPOUTH" description="Input Flag clear for CMPSS11_CTRIPOUTH Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPOUTL" description="Input Flag clear for CMPSS11_CTRIPOUTL Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPOUTH" description="Input Flag clear for CMPSS12_CTRIPOUTH Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPOUTL" description="Input Flag clear for CMPSS12_CTRIPOUTL Signal" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
