ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARCLR3" width="32" page="0" offset="0x108" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 3">
		<bitfield id="SD1FLT1_COMPL" description="Input Flag Clear for SD1FLT1_COMPL Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag Clear for SD1FLT1_COMPH Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag Clear for SD1FLT2_COMPL Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag Clear for SD1FLT2_COMPH Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag Clear for SD1FLT3_COMPL Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag Clear for SD1FLT3_COMPH Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag Clear for SD1FLT4_COMPL Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag Clear for SD1FLT4_COMPH Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag Clear for SD2FLT1_COMPL Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag Clear for SD2FLT1_COMPH Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag Clear for SD2FLT2_COMPL Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag Clear for SD2FLT2_COMPH Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag Clear for SD2FLT3_COMPL Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag Clear for SD2FLT3_COMPH Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag Clear for SD2FLT4_COMPL Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag Clear for SD2FLT4_COMPH Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT1_COMPH" description="Input Flag Clear for SD3FLT1_COMPH Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT1_COMPL" description="Input Flag Clear for SD3FLT1_COMPL Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT2_COMPH" description="Input Flag Clear for SD3FLT2_COMPH Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT2_COMPL" description="Input Flag Clear for SD3FLT2_COMPL Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT3_COMPH" description="Input Flag Clear for SD3FLT3_COMPH Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT3_COMPL" description="Input Flag Clear for SD3FLT3_COMPL Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT4_COMPH" description="Input Flag Clear for SD3FLT4_COMPH Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT4_COMPL" description="Input Flag Clear for SD3FLT4_COMPL Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT1_COMPH" description="Input Flag Clear for SD4FLT1_COMPH Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT1_COMPL" description="Input Flag Clear for SD4FLT1_COMPL Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT2_COMPH" description="Input Flag Clear for SD4FLT2_COMPH Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT2_COMPL" description="Input Flag Clear for SD4FLT2_COMPL Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT3_COMPH" description="Input Flag Clear for SD4FLT3_COMPH Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT3_COMPL" description="Input Flag Clear for SD4FLT3_COMPL Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT4_COMPH" description="Input Flag Clear for SD4FLT4_COMPH Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT4_COMPL" description="Input Flag Clear for SD4FLT4_COMPL Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR4" width="32" page="0" offset="0x10c" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 4">
		<bitfield id="INPUT1" description="Input Flag Clear for INPUT1 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INPUT2" description="Input Flag Clear for INPUT2 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INPUT3" description="Input Flag Clear for INPUT3 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT4" description="Input Flag Clear for INPUT4 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INPUT5" description="Input Flag Clear for INPUT5 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INPUT6" description="Input Flag Clear for INPUT6 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INPUT7" description="Input Flag Clear for INPUT7 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INPUT8" description="Input Flag Clear for INPUT8 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INPUT9" description="Input Flag Clear for INPUT9 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INPUT10" description="Input Flag Clear for INPUT10 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INPUT11" description="Input Flag Clear for INPUT11 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INPUT12" description="Input Flag Clear for INPUT12 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INPUT13" description="Input Flag Clear for INPUT13 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INPUT14" description="Input Flag Clear for INPUT14 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INPUT15" description="Input Flag Clear for INPUT15 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INPUT16" description="Input Flag Clear for INPUT16 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="INPUT17" description="Input Flag Clear for INPUT17 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INPUT18" description="Input Flag Clear for INPUT18 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="INPUT19" description="Input Flag Clear for INPUT19 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="INPUT20" description="Input Flag Clear for INPUT20 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="INPUT21" description="Input Flag Clear for INPUT21 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="INPUT22" description="Input Flag Clear for INPUT22 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="INPUT23" description="Input Flag Clear for INPUT23 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="INPUT24" description="Input Flag Clear for INPUT24 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="INPUT25" description="Input Flag Clear for INPUT25 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="INPUT26" description="Input Flag Clear for INPUT26 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="INPUT27" description="Input Flag Clear for INPUT27 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="INPUT28" description="Input Flag Clear for INPUT28 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="INPUT29" description="Input Flag Clear for INPUT29 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="INPUT30" description="Input Flag Clear for INPUT30 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="INPUT31" description="Input Flag Clear for INPUT31 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="INPUT32" description="Input Flag Clear for INPUT32 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR5" width="32" page="0" offset="0x110" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 5">
		<bitfield id="ADCAEVT1" description="Input Flag Clear for ADCAEVT1 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT2" description="Input Flag Clear for ADCAEVT2 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT3" description="Input Flag Clear for ADCAEVT3 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT4" description="Input Flag Clear for ADCAEVT4 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT1" description="Input Flag Clear for ADCBEVT1 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT2" description="Input Flag Clear for ADCBEVT2 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT3" description="Input Flag Clear for ADCBEVT3 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT4" description="Input Flag Clear for ADCBEVT4 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT1" description="Input Flag Clear for ADCCEVT1 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT2" description="Input Flag Clear for ADCCEVT2 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT3" description="Input Flag Clear for ADCCEVT3 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT4" description="Input Flag Clear for ADCCEVT4 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT1" description="Input Flag Clear for ADCDEVT1 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT2" description="Input Flag Clear for ADCDEVT2 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT3" description="Input Flag Clear for ADCDEVT3 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT4" description="Input Flag Clear for ADCDEVT4 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ADCEEVT1" description="Input Flag Clear for ADCEEVT1 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCEEVT2" description="Input Flag Clear for ADCEEVT2 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ADCEEVT3" description="Input Flag Clear for ADCEEVT3 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ADCEEVT4" description="Input Flag Clear for ADCEEVT4 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT1" description="Input Flag Clear for CPU1_ADCCHECKEVT1 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT2" description="Input Flag Clear for CPU1_ADCCHECKEVT2 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT3" description="Input Flag Clear for CPU1_ADCCHECKEVT3 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT4" description="Input Flag Clear for CPU1_ADCCHECKEVT4 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT1" description="Input Flag Clear for CPU2_ADCCHECKEVT1 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT2" description="Input Flag Clear for CPU2_ADCCHECKEVT2 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT3" description="Input Flag Clear for CPU2_ADCCHECKEVT3 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT4" description="Input Flag Clear for CPU2_ADCCHECKEVT4 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_ADCCHECKEVT1" description="Input Flag Clear for CPU3_ADCCHECKEVT1 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_ADCCHECKEVT2" description="Input Flag Clear for CPU3_ADCCHECKEVT2 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_ADCCHECKEVT3" description="Input Flag Clear for CPU3_ADCCHECKEVT3 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_ADCCHECKEVT4" description="Input Flag Clear for CPU3_ADCCHECKEVT4 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR6" width="32" page="0" offset="0x114" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 6">
		<bitfield id="CLB1_OUT4" description="Input Flag Clear for CLB1_OUT4 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT5" description="Input Flag Clear for CLB1_OUT5 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT4" description="Input Flag Clear for CLB2_OUT4 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT5" description="Input Flag Clear for CLB2_OUT5 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT4" description="Input Flag Clear for CLB3_OUT4 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT5" description="Input Flag Clear for CLB3_OUT5 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT4" description="Input Flag Clear for CLB4_OUT4 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT5" description="Input Flag Clear for CLB4_OUT5 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT4" description="Input Flag Clear for CLB5_OUT4 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT5" description="Input Flag Clear for CLB5_OUT5 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT4" description="Input Flag Clear for CLB6_OUT4 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT5" description="Input Flag Clear for CLB6_OUT5 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FSIA_RX_TRIG1" description="Input Flag Clear for FSIA_RX_TRIG1 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIB_RX_TRIG1" description="Input Flag Clear for FSIB_RX_TRIG1 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIC_RX_TRIG1" description="Input Flag Clear for FSIC_RX_TRIG1 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSID_RX_TRIG1" description="Input Flag Clear for FSID_RX_TRIG1 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT0" description="Input Flag Clear for WADI1OUT0 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT1" description="Input Flag Clear for WADI1OUT1 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT2" description="Input Flag Clear for WADI1OUT2 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT3" description="Input Flag Clear for WADI1OUT3 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT4" description="Input Flag Clear for WADI1OUT4 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT5" description="Input Flag Clear for WADI1OUT5 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT6" description="Input Flag Clear for WADI1OUT6 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="WADI1OUT7" description="Input Flag Clear for WADI1OUT7 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ECATSYNC0" description="Input Flag Clear for ECATSYNC0 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ECATSYNC1" description="Input Flag Clear for ECATSYNC1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
