ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_xbar_regs.xml
	<register id="XBARCLR14" width="32" page="0" offset="0x134" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 14">
		<bitfield id="MDL17_OUTA" description="Input Flag clear for MDL17_OUTA Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MDL17_OUTB" description="Input Flag clear for MDL17_OUTB Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MDL18_OUTA" description="Input Flag clear for MDL18_OUTA Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MDL18_OUTB" description="Input Flag clear for MDL18_OUTB Signal" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR15" width="32" page="0" offset="0x138" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 15">
		<bitfield id="CLB1_OUT0" description="Input Flag clear for CLB1_OUT0 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT1" description="Input Flag clear for CLB1_OUT1 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT2" description="Input Flag clear for CLB1_OUT2 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT3" description="Input Flag clear for CLB1_OUT3 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT6" description="Input Flag clear for CLB1_OUT6 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT7" description="Input Flag clear for CLB1_OUT7 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT0" description="Input Flag clear for CLB2_OUT0 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT1" description="Input Flag clear for CLB2_OUT1 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT2" description="Input Flag clear for CLB2_OUT2 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT3" description="Input Flag clear for CLB2_OUT3 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT6" description="Input Flag clear for CLB2_OUT6 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT7" description="Input Flag clear for CLB2_OUT7 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT0" description="Input Flag clear for CLB3_OUT0 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT1" description="Input Flag clear for CLB3_OUT1 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT2" description="Input Flag clear for CLB3_OUT2 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT3" description="Input Flag clear for CLB3_OUT3 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT6" description="Input Flag clear for CLB3_OUT6 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT7" description="Input Flag clear for CLB3_OUT7 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT0" description="Input Flag clear for CLB4_OUT0 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT1" description="Input Flag clear for CLB4_OUT1 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT2" description="Input Flag clear for CLB4_OUT2 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT3" description="Input Flag clear for CLB4_OUT3 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT6" description="Input Flag clear for CLB4_OUT6 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT7" description="Input Flag clear for CLB4_OUT7 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT0" description="Input Flag clear for CLB5_OUT0 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT1" description="Input Flag clear for CLB5_OUT1 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT2" description="Input Flag clear for CLB5_OUT2 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT3" description="Input Flag clear for CLB5_OUT3 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT6" description="Input Flag clear for CLB5_OUT6 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT7" description="Input Flag clear for CLB5_OUT7 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT0" description="Input Flag clear for CLB6_OUT0 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT1" description="Input Flag clear for CLB6_OUT1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR16" width="32" page="0" offset="0x13c" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 15">
		<bitfield id="CLB6_OUT2" description="Input Flag clear for CLB6_OUT2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT3" description="Input Flag clear for CLB6_OUT3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT6" description="Input Flag clear for CLB6_OUT6 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT7" description="Input Flag clear for CLB6_OUT7 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL0" description="Input Flag clear for ADCA_EXTMUXSEL0 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL1" description="Input Flag clear for ADCA_EXTMUXSEL1 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL2" description="Input Flag clear for ADCA_EXTMUXSEL2 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL3" description="Input Flag clear for ADCA_EXTMUXSEL3 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL0" description="Input Flag clear for ADCB_EXTMUXSEL0 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL1" description="Input Flag clear for ADCB_EXTMUXSEL1 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL2" description="Input Flag clear for ADCB_EXTMUXSEL2 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL3" description="Input Flag clear for ADCB_EXTMUXSEL3 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL0" description="Input Flag clear for ADCC_EXTMUXSEL0 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL1" description="Input Flag clear for ADCC_EXTMUXSEL1 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL2" description="Input Flag clear for ADCC_EXTMUXSEL2 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL3" description="Input Flag clear for ADCC_EXTMUXSEL3 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ADCD_EXTMUXSEL0" description="Input Flag clear for ADCD_EXTMUXSEL0 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCD_EXTMUXSEL1" description="Input Flag clear for ADCD_EXTMUXSEL1 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ADCD_EXTMUXSEL2" description="Input Flag clear for ADCD_EXTMUXSEL2 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ADCD_EXTMUXSEL3" description="Input Flag clear for ADCD_EXTMUXSEL3 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_EXTMUXSEL0" description="Input Flag clear for ADCE_EXTMUXSEL0 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_EXTMUXSEL1" description="Input Flag clear for ADCE_EXTMUXSEL1 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_EXTMUXSEL2" description="Input Flag clear for ADCE_EXTMUXSEL2 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_EXTMUXSEL3" description="Input Flag clear for ADCE_EXTMUXSEL3 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT0" description="Input Flag clear for EPG1_EPGOUT0 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT1" description="Input Flag clear for EPG1_EPGOUT1 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT2" description="Input Flag clear for EPG1_EPGOUT2 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT3" description="Input Flag clear for EPG1_EPGOUT3 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR17" width="32" page="0" offset="0x140" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 16">
		<bitfield id="MCANA_FEVT0" description="Input Flag clear for MCANA_FEVT0 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCANA_FEVT1" description="Input Flag clear for MCANA_FEVT1 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCANA_FEVT2" description="Input Flag clear for MCANA_FEVT2 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT0" description="Input Flag clear for MCANB_FEVT0 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT1" description="Input Flag clear for MCANB_FEVT1 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT2" description="Input Flag clear for MCANB_FEVT2 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCANC_FEVT0" description="Input Flag clear for MCANC_FEVT0 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MCANC_FEVT1" description="Input Flag clear for MCANC_FEVT1 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCANC_FEVT2" description="Input Flag clear for MCANC_FEVT2 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAND_FEVT0" description="Input Flag clear for MCAND_FEVT0 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MCAND_FEVT1" description="Input Flag clear for MCAND_FEVT1 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MCAND_FEVT2" description="Input Flag clear for MCAND_FEVT2 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MCANE_FEVT0" description="Input Flag clear for MCANE_FEVT0 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MCANE_FEVT1" description="Input Flag clear for MCANE_FEVT1 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MCANE_FEVT2" description="Input Flag clear for MCANE_FEVT2 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MCANF_FEVT0" description="Input Flag clear for MCANF_FEVT0 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MCANF_FEVT1" description="Input Flag clear for MCANF_FEVT1 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MCANF_FEVT2" description="Input Flag clear for MCANF_FEVT2 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR18" width="32" page="0" offset="0x144" instances="1" instaddr="4" internal="0" description="X-Bar Input Flag Clear Register 16">
		<bitfield id="FSIRXA_TRIG_2" description="Input Flag clear for FSIRXA_TRIG_2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXA_TRIG_3" description="Input Flag clear for FSIRXA_TRIG_3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXB_TRIG_2" description="Input Flag clear for FSIRXB_TRIG_2 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXB_TRIG_3" description="Input Flag clear for FSIRXB_TRIG_3 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXC_TRIG_2" description="Input Flag clear for FSIRXC_TRIG_2 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXC_TRIG_3" description="Input Flag clear for FSIRXC_TRIG_3 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXD_TRIG_2" description="Input Flag clear for FSIRXD_TRIG_2 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXD_TRIG_3" description="Input Flag clear for FSIRXD_TRIG_3 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT8" description="Input Flag clear for CPU1ERADEVT8 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT9" description="Input Flag clear for CPU1ERADEVT9 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT10" description="Input Flag clear for CPU1ERADEVT10 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT11" description="Input Flag clear for CPU1ERADEVT11 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT8" description="Input Flag clear for CPU2ERADEVT8 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT9" description="Input Flag clear for CPU2ERADEVT9 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT10" description="Input Flag clear for CPU2ERADEVT10 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT11" description="Input Flag clear for CPU2ERADEVT11 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CPU3ERADEVT8" description="Input Flag clear for CPU3ERADEVT8 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPU3ERADEVT9" description="Input Flag clear for CPU3ERADEVT9 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CPU3ERADEVT10" description="Input Flag clear for CPU3ERADEVT10 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CPU3ERADEVT11" description="Input Flag clear for CPU3ERADEVT11 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
</module>
